Repository: nentjes/Autestme
Catalog: Autestme1/*.lproj/Localizable.strings
Languages: es_us, hi

# info_title
source: Game Explanation
es_us: Explicación del juego
hi: खेल की जानकारी

# alert_button_ok
source: OK
es_us: Aceptar
hi: ठीक है

# info_body
source: Welcome to Autestme! In this game, different shapes, letters, or numbers are displayed. Your task is to remember how many times you have seen each item. Game Types: • Shapes – circles, squares, lines, etc. • Letters – random capital letters (A to Z) • Numbers – random numbers (0 to 9) Settings: • Game Duration – how long the game lasts • Tempo – how fast the items appear • Number of items – for shapes: how many different shapes, for letters/numbers: how many different options are chosen from • Color Mode – fixed colors per item or random colors.
es_us: ¡Bienvenido a Autestme! En este juego, se muestran diferentes formas, letras o números. Tu tarea es recordar cuántas veces has visto cada elemento. Tipos de juego: • Formas – círculos, cuadrados, líneas, etc. • Letras – letras mayúsculas aleatorias (A a Z) • Números – números aleatorios (0 a 9) Ajustes: • Duración del juego – cuánto dura el juego • Ritmo – qué tan rápido aparecen los elementos • Número de elementos – para formas: cuántas formas diferentes, para letras/números: de cuántas opciones diferentes se elige • Modo de color – colores fijos por elemento o colores aleatorios.
hi: ऑटेस्टमी में आपका स्वागत है! इस खेल में, विभिन्न आकृतियाँ, अक्षर या संख्याएँ प्रदर्शित की जाती हैं। आपका काम यह याद रखना है कि आपने प्रत्येक आइटम को कितनी बार देखा है। खेल के प्रकार: • आकृतियाँ – वृत्त, वर्ग, रेखाएँ, आदि। • अक्षर – यादृच्छिक बड़े अक्षर (A से Z) • संख्याएँ – यादृच्छिक संख्याएँ (0 से 9) सेटिंग्स: • खेल की अवधि – खेल कितनी देर तक चलता है • गति – आइटम कितनी तेजी से दिखाई देते हैं • आइटम की संख्या – आकृतियों के लिए: कितनी अलग-अलग आकृतियाँ; अक्षरों/संख्याओं के लिए: कितने अलग-अलग विकल्पों में से चुना जाता है • रंग मोड – प्रति आइटम निश्चित रंग या यादृच्छिक रंग।

# info_crypto_title
source: Crypto Rewards
es_us: Recompensas de Cripto
hi: क्रिप्टो पुरस्कार

# info_crypto_explanation
source: The Autestme app uses the Polygon Mainnet Blockchain to reward players with AUteste Tokens. You have a choice of two options: 1. My Wallet: The reward is sent directly to your personal wallet address. 2. Game Treasury: The reward goes to the app's central Treasury. You save towards a larger joint prize pool this way. Swipe right-to-left to make your choice. Your address must be a valid Polygon Mainnet address.
es_us: La aplicación Autestme utiliza la Blockchain de Polygon Mainnet para recompensar a los jugadores con Tokens AUteste. Tienes dos opciones a elegir: 1. Mi Billetera: La recompensa se envía directamente a tu dirección de billetera personal. 2. Tesorería del Juego: La recompensa va a la Tesorería central de la aplicación. De esta manera, ahorras para un fondo de premios conjunto más grande. Desliza de derecha a izquierda para hacer tu elección. Tu dirección debe ser una dirección válida de Polygon Mainnet.
hi: ऑटेस्टमी ऐप खिलाड़ियों को AUteste टोकन से पुरस्कृत करने के लिए Polygon Mainnet ब्लॉकचेन का उपयोग करता है। आपके पास दो विकल्प हैं: 1. मेरा वॉलेट: पुरस्कार सीधे आपके व्यक्तिगत वॉलेट पते पर भेजा जाता है। 2. खेल खजाना: पुरस्कार ऐप के केंद्रीय खजाने में जाता है। इस तरह, आप एक बड़े संयुक्त पुरस्कार पूल के लिए बचत करते हैं। अपनी पसंद बनाने के लिए दाएं से बाएं स्वाइप करें। आपका पता एक वैध Polygon Mainnet पता होना चाहिए।

# start_game_button
source: Start the game
es_us: Iniciar juego
hi: खेल शुरू करें

# player_name_label
source: Player Name
es_us: Nombre del jugador
hi: खिलाड़ी का नाम

# player_name_placeholder
source: Name
es_us: Nombre
hi: नाम

# highscore_display
source: Highscore: %@
es_us: Récord: %@
hi: उच्च स्कोर: %@

# no_highscore
source: No highscore yet
es_us: Sin récord
hi: अभी तक कोई उच्च स्कोर नहीं

# game_duration_label
source: Game duration: %@ seconds
es_us: Duración: %@ segundos
hi: खेल की अवधि: %@ सेकंड

# game_speed_label
source: Speed: %@
es_us: Velocidad: %@
hi: गति: %@

# color_mode_label
source: Color Mode
es_us: Modo de color
hi: रंग मोड

# color_mode_fixed
source: Fixed
es_us: Fijo
hi: निश्चित

# color_mode_random
source: Random
es_us: Aleatorio
hi: यादृच्छिक

# game_type_label
source: Game Type
es_us: Tipo de juego
hi: खेल का प्रकार

# game_type_shapes
source: Shapes
es_us: Formas
hi: आकृतियाँ

# game_type_letters
source: Letters
es_us: Letras
hi: अक्षर

# game_type_numbers
source: Numbers
es_us: Números
hi: संख्याएँ

# item_count_label
source: Number of different %@: %@
es_us: Número de %@ diferentes: %@
hi: विभिन्न %@ की संख्या: %@

# item_type_shapes
source: shapes
es_us: formas
hi: आकृतियों

# item_type_letters
source: letters
es_us: letras
hi: अक्षरों

# item_type_numbers
source: numbers
es_us: números
hi: संख्याओं

# game_screen_title
source: Game Screen
es_us: Pantalla de juego
hi: खेल स्क्रीन

# game_screen_time_left
source: Time remaining: %@ seconds
es_us: Tiempo restante: %@ segundos
hi: शेष समय: %@ सेकंड

# end_screen_title
source: End Screen
es_us: Pantalla final
hi: अंतिम स्क्रीन

# end_screen_results_title
source: Results:
es_us: Resultados:
hi: परिणाम:

# end_screen_score_label
source: Score: %@
es_us: Puntuación: %@
hi: स्कोर: %@

# end_screen_back_button
source: Back to Start
es_us: Volver al inicio
hi: शुरुआत पर वापस जाएं

# end_screen_restart_button
source: Play again
es_us: Jugar de nuevo
hi: फिर से खेलें

# end_screen_item_label
source: Count seen: %@
es_us: Cantidad vista: %@
hi: देखी गई गिनती: %@

# end_screen_result_format
source: Entered: %@ | Actual: %@
es_us: Introducido: %@ | Real: %@
hi: दर्ज: %@ | वास्तविक: %@

# end_screen_input_placeholder
source: Count
es_us: Cantidad
hi: गिनती

# end_screen_reward_title
source: Reward
es_us: Recompensa
hi: पुरस्कार

# end_screen_reward_pending
source: Reward processing...
es_us: Procesando recompensa...
hi: पुरस्कार संसाधित हो रहा है...

# end_screen_reward_success
source: ✅ Reward sent!
es_us: ✅ ¡Recompensa enviada!
hi: ✅ पुरस्कार भेजा गया!

# end_screen_reward_error
source: ❌ Error sending reward.
es_us: ❌ Error al enviar recompensa.
hi: ❌ पुरस्कार भेजने में त्रुटि।

# wallet_address_label
source: Your Wallet Address (Polygon Mainnet)
es_us: Tu Dirección de Billetera (Polygon Mainnet)
hi: आपका वॉलेट पता (पॉलीगॉन मेननेट)

# swipe_to_configure_wallet
source: Swipe to configure your wallet ➡️
es_us: Desliza para configurar tu billetera ➡️
hi: अपना वॉलेट कॉन्फ़िगर करने के लिए स्वाइप करें ➡️

# crypto_mode_own_wallet
source: My Wallet
es_us: Mi Billetera
hi: मेरा वॉलेट

# crypto_mode_game_treasury
source: Treasury
es_us: Tesorería
hi: खजाना

# crypto_mode_info
source: Where should your rewards go?
es_us: ¿A dónde deben ir tus recompensas?
hi: आपके पुरस्कार कहाँ जाने चाहिए?

# address_placeholder
source: 0x... (Polygon Wallet Address)
es_us: 0x... (Dirección de Billetera Polygon)
hi: 0x... (पॉलीगॉन वॉलेट पता)
